#include "gtest/gtest.h"
#include "应用层测试环境.h"
#include "主适配器事件测试环境.h"
#include "从适配器测试环境.h"
#include "../../公共测试方法.h"
#include "../../../src/转账BC/从适配器/转账DAO.h"
#include "主适配器命令测试环境.h"

int 创建转账(std::string 付款方,std::string 收款方,float 金额,转账::状态 状态){
    转账 转账_=转账::构造旧的转账(rand(),转账用户(付款方),转账用户(收款方),金额,状态);
    转账仓储模拟::获取已存在的单例()->新增转账(转账_);
    return 转账_.获取单号();
}
TEST_F(应用层测试环境, 申请转账){
    检查转账状态(申请转账(用户服务模拟_,"XX","YY",100),转账::已创建);
}
void 测试帐户冻结时申请转账(用户服务接口 * 用户服务模拟_,bool 冻结付款方,bool 冻结收款方){
    创建用户(用户服务模拟_,"XX",冻结付款方,"YY",冻结收款方);
    转账服务接口* 转账服务_= 命名服务管理器::获取单例()->查找服务<转账服务接口 *>("转账服务").value();
    ASSERT_THROW(转账服务_->申请转账("XX", "YY",100), 异常);
}
TEST_F(应用层测试环境, 付款用户冻结时申请转账){
    测试帐户冻结时申请转账(用户服务模拟_,true,false);
}
TEST_F(应用层测试环境, 收款用户冻结时申请转账){
    测试帐户冻结时申请转账(用户服务模拟_,false,true);
}
转账服务接口* 获取转账命令服务(){
    return 命名服务管理器::获取单例()->查找服务<转账服务接口 *>("转账服务").value();
}
int 初始化转账(转账::状态 状态){
    return 创建转账("XX","YY",100,状态);
}
TEST_F(应用层测试环境, 通知已出账){
    int 单号=初始化转账(转账::已创建);
    获取转账命令服务()->通知出账(单号);
    检查转账状态(单号,转账::已出账);
}
TEST_F(应用层测试环境, 通知已取消){
    int 单号=初始化转账(转账::已创建);
    获取转账命令服务()->通知取消(单号,异常(""));
    检查转账状态(单号,转账::已取消);
}
TEST_F(应用层测试环境, 通知已到账){
    int 单号=初始化转账(转账::已出账);
    获取转账命令服务()->通知到账(单号,"YY");
    检查转账状态(单号,转账::已到账);
}
TEST_F(应用层测试环境, 资金出账后账号被冻结){
    创建用户(用户服务模拟_,"XX","YY");
    int 单号=初始化转账(转账::已出账);
    用户服务模拟_->冻结用户("YY");
    ASSERT_THROW(获取转账命令服务()->通知到账(单号,"YY"), 异常);
}
TEST_F(应用层测试环境, 通知申请退款){
    int 单号=初始化转账(转账::转账::已出账);
    获取转账命令服务()->通知申请退款(单号,异常(""));
    检查转账状态(单号,转账::退款中);
}
TEST_F(应用层测试环境, 完成退款){
    int 单号=初始化转账(转账::转账::退款中);
    获取转账命令服务()->通知到账(单号,"XX");
    检查转账状态(单号,转账::已退回);
}
TEST_F(主适配器事件测试环境, 通知取消已调用){
    事件发布订阅服务::构建单例()->发布(领域事件("扣减已失败", 0, 异常("")));
    ASSERT_EQ(转账服务模拟::获取单例()->通知取消已调用,true);
}
TEST_F(主适配器事件测试环境, 通知出账已调用){
    事件发布订阅服务::构建单例()->发布(领域事件("扣减已成功", 0, ""));
    ASSERT_EQ(转账服务模拟::获取单例()->通知出账已调用,true);
}
TEST_F(主适配器事件测试环境, 通知到账已调用){
    事件发布订阅服务::构建单例()->发布(领域事件("增资已成功", 0, 增资已成功DTO(0, "YY", 1)));
    ASSERT_EQ(转账服务模拟::获取单例()->通知到账已调用,true);
}
TEST_F(主适配器事件测试环境, 通知申请退款已调用){
    事件发布订阅服务::构建单例()->发布(领域事件("增资已失败", 0, 异常("")));
    ASSERT_EQ(转账服务模拟::获取单例()->通知申请退款已调用,true);
}
TEST_F(主适配器事件测试环境, 通知退款已调用){
    事件发布订阅服务::构建单例()->发布(领域事件("增资已成功", 0, 增资已成功DTO(0, "XX", 1)));
    ASSERT_EQ(转账服务模拟::获取单例()->通知退款已调用,true);
}
int 仓储新增转账(std::string 转账方,std::string 收款方,float 金额) {
    转账仓储 *转账仓储_ = 转账仓储::获取单例();
    转账 转账_ = 转账::构造新的转账(
            转账用户(转账方, false),
            转账用户(收款方, false),
            金额);
    转账仓储_->新增转账(转账_);
    return 转账_.获取单号();
}
TEST_F(从适配器层转账仓储测试环境, 仓储新增转账){
    int 单号=仓储新增转账("XX","YY",10);
    ASSERT_EQ(转账仓储::获取单例()->获取必须存在的转账(单号).获取状态(),转账::已创建);
}
TEST_F(从适配器层转账仓储测试环境, 仓储更新转账状态){
    int 单号=仓储新增转账("XX","YY",10);
    转账仓储::获取单例()->更新转账状态(单号,转账::已出账);
    ASSERT_EQ(转账仓储::获取单例()->获取必须存在的转账(单号).获取状态(),转账::已出账);
}
int DAO新增转账PO(int 单号,std::string 转账方,std::string 收款方,float 金额,int 状态){
    转账DAO* 转账DAO_= 转账DAO::构建单例();
    转账PO 转账PO_(单号,转账方,收款方,状态,金额);
    转账DAO_->新增转账PO(转账PO_);
    return 转账PO_.单号;
}
TEST(从适配器层转账DAO测试, 新增){
    int 单号=DAO新增转账PO(1,"XX","YY",10,0);
    转账DAO* 转账DAO_= 转账DAO::构建单例();
    ASSERT_EQ(转账DAO_->获取转账PO(单号)->状态,0);
}
TEST(从适配器层转账DAO测试,更新转账PO状态){
    int 单号=DAO新增转账PO(1,"XX","YY",10,0);
    转账DAO* 转账DAO_= 转账DAO::构建单例();
    转账DAO_->更新转账PO状态(单号,2);
    ASSERT_EQ(转账DAO_->获取转账PO(单号)->状态,2);
}
TEST_F(主适配器命令测试环境,处理转账命令){
    Protobuf请求适配器 * PB请求适配器_= 命名服务管理器::获取单例()->查找服务<Protobuf请求适配器 *>("Protobuf请求适配器").value();
    PB请求适配器_->请求命令("");
}

