#ifndef TRANSFER_资金帐户服务工厂_H
#define TRANSFER_资金帐户服务工厂_H
#include "应用层/资金帐户服务.h"
#include "从适配器/资金帐户仓储.h"
#include "从适配器/资金帐户查询.h"
#include "从适配器/资金帐户DAO.h"
#include "主适配器/资金事件处理器.h"
class 资金帐户服务工厂 {
public:
    static 资金帐户服务接口 *获取单例(){
        资金帐户仓储接口 * 资金帐户仓储接口_= 资金帐户仓储::构建单例(资金帐户DAO::构建单例());
        资金帐户查询接口 * 资金帐户查询接口_= 资金帐户查询::构建单例(资金帐户DAO::构建单例());
        return 资金帐户服务::构建单例(资金帐户仓储接口_, 资金帐户查询接口_);
    }
    static void 销毁单例(){
         资金帐户DAO::销毁单例();
         资金帐户仓储::销毁单例();
         资金帐户查询::销毁单例();
         资金帐户服务::销毁单例();
    }
};
#endif //TRANSFER_资金帐户服务工厂_H
