#include "gtest/gtest.h"
#include "主适配器测试环境.h"
#include "从适配器仓储与查询测试环境.h"
#include "应用服务测试环境.h"
#include "../../../src/资金帐户BC/从适配器/资金帐户DAO.h"
TEST_F(主适配器事件测试环境, 转账已创建){
    事件发布订阅服务::构建单例()->发布(领域事件("转账已创建", 0,
                              转账已创建DTO(0, "XX", 1)));
    ASSERT_EQ(资金帐户服务模拟_->已经扣减资金,true);
}
TEST_F(主适配器事件测试环境, 已添加资金帐户){
    事件发布订阅服务::构建单例()->发布(领域事件("用户已创建", 0, 用户已创建DTO("XX")));
    ASSERT_EQ(资金帐户服务模拟_->已添加资金帐户,true);
}
TEST_F(主适配器事件测试环境, 已经到账){
    事件发布订阅服务::构建单例()->发布(领域事件("转账已出账", 0,
                              转账已出账DTO(0, "YY", 1)));
    ASSERT_EQ(资金帐户服务模拟_->已经到账,true);
}
TEST_F(主适配器事件测试环境, 已经退款){
    事件发布订阅服务::构建单例()->发布(领域事件("转账退款中", 0,
                              转账退款事件(0, "XX", 1)));
    ASSERT_EQ(资金帐户服务模拟_->已经退款,true);
}
资金帐户 创建资金帐户(std::string 账号){
    资金帐户 资金帐户_(账号);
    资金帐户仓储::获取单例()->新增资金帐户(资金帐户_);
    return 资金帐户_;
}
TEST_F(从适配器仓储与查询测试环境, 新增资金帐户){
    创建资金帐户("XX");
    ASSERT_EQ(资金帐户查询::获取单例()->获取资金帐户("XX")->获取账号(), "XX");
}
TEST_F(从适配器仓储与查询测试环境, 更新资金帐户){
    std::string 账号="XX";
    创建资金帐户(账号);
    资金帐户 资金帐户_ = 资金帐户(账号,false,false,5);
    资金帐户仓储::获取单例()->更新资金帐户(资金帐户_);
    ASSERT_EQ(资金帐户查询::获取单例()->获取资金帐户(账号)->获取金额(), 5);
}
TEST_F(应用服务测试环境, 添加资金帐户){
    资金帐户服务::获取单例()->添加资金帐户("XX");
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX").has_value(), true);
}
TEST_F(应用服务测试环境, 初始化资金){
    资金帐户服务::获取单例()->添加资金帐户("XX");
    资金帐户服务::获取单例()->初始化资金("XX", 10);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->获取金额(), 10);
}
void 初始化资金(std::string 账号,float 金额){
    资金帐户服务::获取单例()->添加资金帐户(账号);
    资金帐户服务::获取单例()->初始化资金(账号, 金额);
}
TEST_F(应用服务测试环境, 增加资金){
    初始化资金("XX",10);
    资金帐户服务::获取单例()->增加资金(1,"XX",10);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->获取金额(), 20);
}
TEST_F(应用服务测试环境, 扣减资金){
    初始化资金("XX",10);
    资金帐户服务::获取单例()->扣减资金(1,"XX",3);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->获取金额(), 7);
}
TEST_F(应用服务测试环境, 设置禁止付款){
    资金帐户服务::获取单例()->添加资金帐户("XX");
    资金帐户服务::获取单例()->设置禁止付款("XX", true);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->是否禁止转出(),  true);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->是否禁止转入(),  false);
}
TEST_F(应用服务测试环境, 禁止付款){
    初始化资金("XX",10);
    资金帐户服务::获取单例()->设置禁止付款("XX", true);
    资金帐户服务::获取单例()->扣减资金(1,"XX",3);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->获取金额(),  10);
}
TEST_F(应用服务测试环境, 设置禁止收款){
    资金帐户服务::获取单例()->添加资金帐户("XX");
    资金帐户服务::获取单例()->设置禁止收款("XX", true);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->是否禁止转入(),  true);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->是否禁止转出(),  false);
}
TEST_F(应用服务测试环境, 禁止收款) {
    资金帐户服务::获取单例()->添加资金帐户("XX");
    资金帐户服务::获取单例()->初始化资金("XX", 10);
    资金帐户服务::获取单例()->设置禁止收款("XX", true);
    资金帐户服务::获取单例()->增加资金(1,"XX",3);
    ASSERT_EQ(资金帐户服务::获取单例()->获取资金帐户("XX")->获取金额(), 10);
}
void 增加资金帐户PO(资金帐户PO &资金帐户PO_){
    资金帐户DAO* 资金帐户DAO_=资金帐户DAO::构建单例();
    资金帐户DAO_->新增资金帐户PO(资金帐户PO_);
}
void 验证资金帐户PO成功(资金帐户PO &资金帐户PO_){
    boost::optional<资金帐户PO> 结果=资金帐户DAO::构建单例()->获取资金帐户PO(资金帐户PO_.账号);
    ASSERT_EQ(结果.has_value(), true);
    ASSERT_EQ(结果.value().账号, 资金帐户PO_.账号);
    ASSERT_EQ(结果.value().禁止转入_, 资金帐户PO_.禁止转入_);
    ASSERT_EQ(结果.value().禁止转出_, 资金帐户PO_.禁止转出_);
    ASSERT_EQ(结果.value().金额_, 资金帐户PO_.金额_);
}
void 验证资金帐户PO失败(资金帐户PO &资金帐户PO_){
    boost::optional<资金帐户PO> 结果=资金帐户DAO::构建单例()->获取资金帐户PO(资金帐户PO_.账号);
    ASSERT_EQ(结果.has_value(), false);
}
TEST(DAO测试,增加){
    资金帐户PO 资金帐户PO_("XX", false, false,10);
    增加资金帐户PO(资金帐户PO_);
    验证资金帐户PO成功(资金帐户PO_);
}
TEST(DAO测试,更改){
    资金帐户PO 资金帐户PO_1("XX", false, false,10);
    增加资金帐户PO(资金帐户PO_1);
    资金帐户PO 资金帐户PO_2("YY", true, true,20);
    资金帐户DAO::构建单例()->更新资金帐户PO(资金帐户PO_2);
    验证资金帐户PO失败(资金帐户PO_2);
    资金帐户PO 资金帐户PO_3("XX", true, true,20);
    资金帐户DAO::构建单例()->更新资金帐户PO(资金帐户PO_3);
    验证资金帐户PO成功(资金帐户PO_3);
}